{
    "tooltip_dict_key": "testing tooltip_dicts!",
    "display_name": "<name> - The name of the mission that will be displayed",
    "description": "<text> - A short description of the mission",
    "is_blocked": "<message> - This is a short message that is displayed to the player if this mission cannot be offered, but only because they do not have enough cargo space or bunks available.",
    "deadline": "The number of days you have to complete the mission. If the number of days is left out, a default is calculated.\n\n[<days#>] - The number of days to complete the mission\n\n[<multiplier#>] - A multiplier for the number of jumps to the destination, game defaults to 2.",
    "cargo": "This specifies the cargo that you are carrying.\n\n<(random | <name>)> - If <name> is defined in Endless Sky, it will be replaced with a more specific name, e.g. \"Food\" could become \"grapes\" or \"cheese\". If random is given, then the game will pick a name at runtime. YOU MUST CHOOSE ONE OR THE OTHER.\n\n<number#> - The amount of cargo\n\n[<number#>] - If this number is also given, then a random amount will be chosen between the two.\n\n[<probability#>] - A number the game will use to skew the amount chosen.",
    "passengers": "This specifies the number of passengers. Just like CARGO, if there are two or three numbers they are used to pick a random number.",
    "illegal": "If selected, government will fine you the <fine> if they catch you.\n\n<fine#> - The amount of money the player is fined if caught, if the fine is negative and the player is caught the government will become immediately hostile, NO MATTER WHAT.\n\n[<message>] - An optional message the player will receive if caught.",
    "stealth": "If selected, the mission will fail if you are caught with the cargo or passengers",
    "invisible": "This specifies that the mission does not show up in the player's list of missions, and cannot be aborted.",
    "priority_level": "If a mission is marked with priority, only other \"priority\" missions can be offered alongside it.\n\nIf a mission is marked with minor, it will be offered only if no other missions are being offered at the same time.\n\nThe priority marker is only used for the \"intro\" missions, to suppress all other missions while the player is just learning the ropes.",
    "where_shown": "This specifies where this mission will be shown, if someplace other than the spaceport.\n\njob - will appear only if included in the job board.\n\nlanding - it shows up as soon as you land instead of waiting for you to visit the spaceport.\n\nassisting - will be shown when you repair a friendly ship.\n\nboarding - will be shown when you plunder a hostile ship.",
    "repeat": "Makes a mission repeatable indefinitely.\n\n[<times#>] - The maximum number of times a mission can be repeated",
    "clearance": "This gives you landing clearance on the destination planet, even if normally you would not be allowed to land there, or would have to pay a bribe.\n\n[<message>] - When selected, if you hail your destination planet that message will be shown as the initial text, landing permission will be granted, and you will not have to pay a bribe.",
    "infiltrating": "This indicates that you do not have access to any of the services on the destination planet, including refueling or repairing; all you can do is complete your mission and then leave.",
    "waypoint": "<system> - This specifies a system which you must fly through in order to complete the mission. You do not have to land on any planets or spend any amount of time there.",
    "stopover": "<planet> - This specifies a planet that you must visit in order to complete the mission.",
    "source": "<planet> - A planet where the mission will be offered from. If no source is specified, the mission will be offered whenever its to offer conditions are satisfied.",
    "destination": "<planet> - A mission can be offered from a planet or ship, but all missions must have a destination planet. For missions offered on a planet, if no destination is given that same planet is used.",
    "trigger_on_action": "There are eight events that can trigger a response of some sort:\n\noffer: when the initial mission is offered.\n\ncomplete: when the mission is completed.\n\naccept: if the player agrees to accept a mission.\n\ndecline: if the player decides to decline a mission.\n\ndefer: if the player decides to defer a mission.\n\nfail: if the mission fails.\n\nvisit: you land on the mission's destination, without failing or completing yet.\n\nstopover: you have landed on the last of the planets that are specified as a \"stopover\" point for this mission.",
    "trigger_dialog": "<text> - This gives a message to be displayed in a dialog message to the user. If the trigger is on offer, the dialog will have \"accept\" and \"decline\" buttons.",
    "trigger_outfit": "<outfit> - The name of the outfit to be added to the player's ship\n\n[<number#>] - A number of the outfit to be added.",
    "trigger_require": "<require> - The name of the outfit that the player's ship must have\n\n[<number#>] - A number of the outfit required.",
    "trigger_payment": "This specifies payment for a mission. If no base or multiplier is given, the default is base = 0, multiplier = 150. The formula can be found on Endless Sky's \"Creating Missions\" page.\n\n[<base#>] - The base amount of money earned.\n\n[<multiplier#>] - A multiplier to increase the amount earned.",
    "trigger_event": "This specifies that the given event happens at this point in the mission.\n\n<name> - The identifier of the game event.\n\n[<delay#>] - a number of days to wait before the event occurs.\n\n[<max#>] - The maximum delay, if given, the total delay is randomly chosen from between the two.",
    "trigger_fail": "This causes the named mission (or this mission, if no name is given) to fail immediately.\n\n<name> - the UNIQUE MISSION NAME, NOT the Mission Display name.",
    "log_message_only": "Adds an entry to the player log.\n\n<message> - A message to add to the logbook.",
    "log_complex": "Adds an entry to the player log.\n\n<type> - The type of log, e.g. \"Person\".\n\n<name> - The name of the object, e.g. \"Katya\".\n\n<message> - A message to add to the logbook.",
    "trigger_condition_0": "This is used to adjust the \"conditions\", which form the requirements for other missions.\n\n<condition> - The condition being modified.\n\n(= | += | -=) - Basic mathematical operations.\n\n<value#> - The value used in the calculations.",
    "trigger_condition_1": "This is used to adjust the \"conditions\", which form the requirements for other missions.\n\n<condition> - The condition being modified.\n\n(++ | --) - As a shortcut, ++ means += 1 and -- means -= 1.",
    "trigger_condition_2": "This is used to adjust the \"conditions\", which form the requirements for other missions.\n\n(set | clear) - Sets the condition to 1 or 0, respectively.\n\n<condition> - The condition being modified."
}